In [11]:
import numpy as np
import pandas as pd
df = pd.read_csv("titanic.csv", sep="\t")
df.head(20)
df[(df['Survived'] == 1) &
              (df['Sex'] == 'male') &
              (df['Embarked'] == 'S') &
              (df['Fare'] > 30)].mean()

C:\Users\valee\AppData\Local\Temp\ipykernel_1280\42507022.py:4: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df[(df['Survived'] == 1) &

PassengerId    5.166667e+01
Survived       1.000000e+00
Pclass         1.666667e+00
Age            3.000000e+01
SibSp          0.000000e+00
Parch          0.000000e+00
Ticket         3.792940e+13
Fare           4.249860e+01
dtype: float64

In [14]:
df['Pclass'].value_counts(normalize=True).sort_index()

1    0.192308
2    0.192308
3    0.615385
Name: Pclass, dtype: float64

In [15]:
df.head(20)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,31.0,1,0,345763,18.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C

In [32]:
def sum_of_digits(number: str) -> int:
    return sum(map(int, number))


def is_lucky(ticket: str) -> bool:
    if ticket.isdecimal() and len(ticket) % 2 == 0:
        center = len(ticket) // 2
        return sum_of_digits(ticket[:center]) == sum_of_digits(ticket[center:])
    return False

In [51]:
def sum_of_digits(number: str) -> int:
    return sum(map(int, number))


def is_lucky(ticket) -> bool:
    if ticket.isdecimal() and len(ticket) % 2 == 0:
        center = len(ticket) // 2
        return sum_of_digits(ticket[:center]) == sum_of_digits(ticket[center:])
    return False

islucky = df["Ticket"].apply(is_lucky)
print(islucky)
df[islucky]["Survived"].mean()

0      False
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154    False
155    False
Name: Ticket, Length: 156, dtype: bool

0.25

In [50]:
df[islucky]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S
48,49,0,3,"Samaan, Mr. Youssef",male,NaN,2,0,2662,21.6792,NaN,C
73,74,0,3,"Chronopoulos, Mr. Apostolos",male,26.0,1,0,2680,14.4542,NaN,C

In [53]:
df[islucky]['Survived']

16    0
25    1
48    0
73    0
Name: Survived, dtype: int64

In [61]:
x = np.array([1, 3, 5, 7])
degrees = np.arange(len(x))
x, degrees
print(x[:,np.newaxis])
np.power(x[:, np.newaxis], degrees)

[[1]
 [3]
 [5]
 [7]]

array([[  1,   1,   1,   1],
       [  1,   3,   9,  27],
       [  1,   5,  25, 125],
       [  1,   7,  49, 343]], dtype=int32)